ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
/***************************************************************************//**
* \file cy_ble_cps.c
* \version 2.0
*
* \brief
*  Contains the source code for Cycling Power Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_CPS))

static cy_ble_callback_t Cy_BLE_CPS_ApplCallback = NULL;

#ifdef CY_BLE_CPS_SERVER
/* The internal storage for the last request handle to check response for server */
static cy_ble_gatt_db_attr_handle_t cy_ble_cpssReqHandle;

cy_stc_ble_cps_cp_adjustment_t cy_ble_cpssAdjustment;
static uint8_t cy_ble_cpssFlag;
static cy_stc_ble_gap_conn_param_updated_in_controller_t cy_ble_cpssConnParam;
#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
/* CPS Center Service characteristics GATT DB handles structure */
cy_stc_ble_cpsc_t cy_ble_cpsc[CY_BLE_CONFIG_GATTC_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_cpscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

static uint8_t cy_ble_cpscFlag[CY_BLE_CONFIG_GATTC_COUNT];
static cy_stc_ble_timer_info_t cy_ble_cpscCpTimeout[CY_BLE_CONFIG_GATTC_COUNT];
static uint8_t cy_ble_cpscObserverFlag;
#endif /* (CY_BLE_CPS_CLIENT) */

#if CY_BLE_GAP_ROLE_BROADCASTER
cy_stc_ble_gapp_disc_param_t cy_ble_cpssBroadcastParam;
cy_stc_ble_gapp_disc_data_t cy_ble_cpssBroadcastData =    
{
    {   /* Length, FLAGS, BR/EDR NOT Supported */
        CY_BLE_GAP_ADV_FLAGS_PACKET_LENGTH, (uint8_t)CY_BLE_GAP_ADV_FLAGS, CY_BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED,

        /* Advertising Interval data type contains the advInterval value */
        CY_BLE_GAP_ADV_ADVERT_INTERVAL_PACKET_LENGTH, (uint8_t)CY_BLE_GAP_ADV_ADVERT_INTERVAL,
        CY_LO8(CY_BLE_GAP_ADV_ADVERT_INTERVAL_NONCON_MIN), CY_HI8(CY_BLE_GAP_ADV_ADVERT_INTERVAL_NONCON_MIN),

        /* The Service Data data type consists of a CPS service UUID with the Cycling Power Measurement
         * characteristic value */
        CY_BLE_CPSS_BROADCAST_DATA_LEN_MIN,                                 /* Packet length */
        (uint8_t)CY_BLE_GAP_ADV_SRVC_DATA_16UUID,                           /* Service Data */
        CY_LO8(CY_BLE_UUID_CPS_SERVICE), CY_HI8(CY_BLE_UUID_CPS_SERVICE),   /* CPS service UUID */
        0x00u, 0x00u,                                                       /* Flags */
        0x11u, 0x11u,                                                       /* Instantaneous Power */
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u
    },

    /* Advertising data length */
    CY_BLE_CPSS_BROADCAST_DATA_LEN_MIN + CY_BLE_CPSS_BROADCAST_HEADER_LEN,
};

cy_stc_ble_gapp_disc_mode_info_t cy_ble_cpssBroadcastModeInfo =
{
    CY_BLE_GAPP_NONE_DISC_BROADCAST_MODE,           /* discMode */
    &cy_ble_cpssBroadcastParam,
    &cy_ble_cpssBroadcastData,
    NULL,
    0u,                                             /* advTo */
};
#endif /* CY_BLE_GAP_ROLE_BROADCASTER */

/* The pointer on global BLE CPS Config structure */
cy_stc_ble_cps_config_t *cy_ble_cpsConfigPtr;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_CPS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_CPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_CPSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_CPSS_ConnParamUpdateRspEventHandler(const cy_stc_ble_l2cap_conn_update_rsp_param_t *eventParam);
static void Cy_BLE_CPSS_ConnUpdateCompleteEventHandler(const cy_stc_ble_gap_conn_param_updated_in_controller_t
                                                       *eventParam);

#if CY_BLE_GAP_ROLE_BROADCASTER
static void Cy_BLE_CPSS_AdvertisementStartStopEventHandler(void);
#endif /* CY_BLE_GAP_ROLE_BROADCASTER */
#endif     /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
static void Cy_BLE_CPSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_CPSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_CPSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_CPSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_CPSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);
static void Cy_BLE_CPSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_CPSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_CPSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
static void Cy_BLE_CPSC_ScanStartStopEventHandler(void);
static void Cy_BLE_CPSC_ScanProcessEventHandler(cy_stc_ble_gapc_adv_report_param_t *eventParam);
static void Cy_BLE_CPSC_TimeOutEventHandler(const cy_stc_ble_timeout_param_t *eventParam);
#endif /* (CY_BLE_CPS_CLIENT) */

static cy_en_ble_gatt_err_code_t Cy_BLE_CPS_EventHandler(uint32_t eventCode, void *eventParam);


#ifdef CY_BLE_CPS_SERVER
/******************************************************************************
* Function Name: Cy_BLE_CPSS_Init
***************************************************************************//**
*
*  This function initializes CPS Service in Server role.
*
******************************************************************************/
void Cy_BLE_CPSS_Init(void)
{
    cy_ble_cpssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    cy_ble_cpssFlag = 0u;
}

#endif /* CY_BLE_CPS_SERVER */

