ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
/******************************************************************************
* Function Name: Cy_BLE_CPSS_WriteEventHandler
***************************************************************************//**
*
*  Handles Write Request Event for CPS service.
*
*  \param void *eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - write is successful
*   * CY_BLE_GATT_ERR_PROCEDURE_ALREADY_IN_PROGRESS
*   * CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_CPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_cps_char_index_t locCharIndex;
    cy_stc_ble_cps_char_value_t locCharValue = { .connHandle = eventParam->connHandle };
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint8_t locReqHandle = 0u;

    if(Cy_BLE_CPS_ApplCallback != NULL)
    {
        /* Error conditions for CP Characteristic value write request */
        if((eventParam->handleValPair.attrHandle == cy_ble_cpsConfigPtr->cpss->charInfo[CY_BLE_CPS_POWER_CP].charHandle) &&
           (!CY_BLE_IS_INDICATION_ENABLED(eventParam->connHandle.attId,
                                          cy_ble_cpsConfigPtr->cpss->charInfo[CY_BLE_CPS_POWER_CP].
                                           descrHandle[CY_BLE_CPS_CCCD])))
        {
            gattErr = CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if((eventParam->handleValPair.attrHandle ==
                 cy_ble_cpsConfigPtr->cpss->charInfo[CY_BLE_CPS_POWER_CP].charHandle) &&
                ((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_CP_PROCEDURE_IN_PROGRESS) != 0u))
        {
            gattErr = CY_BLE_GATT_ERR_PROCEDURE_ALREADY_IN_PROGRESS;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            for(locCharIndex = CY_BLE_CPS_POWER_MEASURE; (locCharIndex < CY_BLE_CPS_CHAR_COUNT) && (locReqHandle == 0u);
                locCharIndex++)
            {
                if((eventParam->handleValPair.attrHandle == cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].
                     descrHandle[CY_BLE_CPS_CCCD]) ||
                   (eventParam->handleValPair.attrHandle == cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].
                     descrHandle[CY_BLE_CPS_SCCD]) ||
                   (eventParam->handleValPair.attrHandle == cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].charHandle))
                {
                    /* Store value to database */
                    cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                    {
                        .handleValuePair = eventParam->handleValPair,
                        .connHandle      = eventParam->connHandle,
                        .offset          = 0u,
                        .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                    };

                    /* Clear event handled flag to send Write response */
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    locReqHandle = 1u;

                    locCharValue.charIndex = locCharIndex;
                    locCharValue.value = &eventParam->handleValPair.value;


                    gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        /* Characteristic value write request */
                        if(eventParam->handleValPair.attrHandle ==
                           cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].charHandle)
                        {
                            Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_WRITE_CHAR, &locCharValue);

                            /* In the context of the Cycling Power Control Point characteristic, a procedure is started
                             * when a write to the Cycling Power Control Point characteristic is successfully completed
                             */
                            if(locCharIndex == CY_BLE_CPS_POWER_CP)
                            {
                                cy_ble_cpssFlag |= CY_BLE_CPSS_FLAG_CP_PROCEDURE_IN_PROGRESS;
                            }
                        }

                        /* Client Characteristic Configuration descriptor write request */
                        else if(eventParam->handleValPair.attrHandle ==
                                cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].descrHandle[CY_BLE_CPS_CCCD])
                        {
                            /* Check characteristic properties for Notification */
                            if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].
                                                                 charHandle))
                            {
                                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                {
                                    uint16_t requiredConnIntv;
                                    uint8_t prefConnParamCharValue[CY_BLE_PPCPC_LEN];
                                    requiredConnIntv = CY_BLE_CPS_SAMLING_RATE_TO_CONN_INTV /
                                                       cy_ble_cpssAdjustment.samplingRate;

                                    /* Cycling Power Vector characteristic has special behavior
                                     * described in CPS specification, section 3.5.1 */
                                    if((locCharIndex == CY_BLE_CPS_POWER_VECTOR) &&
                                       (cy_ble_cpssConnParam.connIntv > requiredConnIntv))
                                    {
                                        /* Read characteristic value from database */
                                        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfoCCCD =
                                        {
                                            .handleValuePair.attrHandle = cy_ble_configPtr->gaps->prefConnParamCharHandle,
                                            .handleValuePair.value.len  = sizeof(prefConnParamCharValue),
                                            .handleValuePair.value.val  = prefConnParamCharValue,
                                            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
                                        };

