ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
                                        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfoCCCD) ==
                                           CY_BLE_GATT_ERR_NONE)
                                        {
                                            /* If the current connection parameters do not allow sending of
                                             * notification, request new connection parameters by using the GAP
                                             * Connection Parameter Update procedure.
                                             */
                                            cy_stc_ble_gap_conn_update_param_info_t connUpdateParam =
                                            {
                                                /* Send Connection Parameter Update Request to Client */
                                                .connIntvMin   = requiredConnIntv,
                                                .connIntvMax   = requiredConnIntv,
                                                .connLatency   = Cy_BLE_Get16ByPtr(prefConnParamCharValue +
                                                                                   CY_BLE_PPCPC_SLAVE_LATENCY_OFFSET),
                                                .supervisionTO = Cy_BLE_Get16ByPtr(prefConnParamCharValue +
                                                                                   CY_BLE_PPCPC_SUP_TIMEOUT_OFFSET),
                                                .bdHandle      = eventParam->connHandle.bdHandle
                                            };

                                            if(Cy_BLE_L2CAP_LeConnectionParamUpdateRequest(&connUpdateParam)
                                               == CY_BLE_SUCCESS)
                                            {
                                                cy_ble_cpssFlag |= CY_BLE_CPSS_FLAG_PV_PROCEDURE_IN_PROGRESS;

                                                /* Set event handled flag to not send Write response. Response will be
                                                 * sent when Central accept the request for connection parameter update
                                                 * in Cy_BLE_CPSS_ConnParamUpdateRspEventHandler function.
                                                 */
                                                cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;
                                            }
                                        }
                                    }
                                    else
                                    {
                                        Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_NOTIFICATION_ENABLED,
                                                                &locCharValue);
                                    }
                                }
                                else
                                {
                                    Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_NOTIFICATION_DISABLED,
                                                            &locCharValue);
                                }
                            }

                            /* Check characteristic properties for Indication */
                            if(CY_BLE_IS_INDICATION_SUPPORTED(cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].charHandle))
                            {
                                if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                {
                                    Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_INDICATION_ENABLED, &locCharValue);
                                }
                                else
                                {
                                    Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_INDICATION_DISABLED, &locCharValue);
                                }
                            }
                        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                            /* Set flag to store bonding data to flash */
                            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                            {
                                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                            }
                        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                        }
                        /* Server Characteristic Configuration descriptor write request */
                        else
                        {
                            /* Check characteristic properties for Broadcast */
                            if(CY_BLE_IS_BROADCAST_SUPPORTED(cy_ble_cpsConfigPtr->cpss->charInfo[locCharIndex].
                                                              charHandle))
                            {
                                if(CY_BLE_IS_BROADCAST_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                {
                                    Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_BROADCAST_ENABLED, &locCharValue);
                                }
                                else
                                {
                                    Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_BROADCAST_DISABLED, &locCharValue);
                                }
                            }
                        }
                    }
                }
            }
        }
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_CPSS_SendNotification
***************************************************************************//**
*
*  Sends notification with a characteristic value of the CPS, which is a value
*  specified by charIndex, to the Client device.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  'Handle Value Notification' which results in CY_BLE_EVT_CPSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle:      The connection handle
*  \param charIndex:       The index of a service characteristic of type
*                   cy_en_ble_cps_char_index_t.
*  \param attrSize:        The size of the characteristic value attribute.
*  \param attrValue:      The pointer to the characteristic value data that should be
*                   sent to the Client device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request handled successfully
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed
*   * CY_BLE_ERROR_INVALID_OPERATION - This operation is not permitted
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the Client is not established
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the Client.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CPSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                    cy_en_ble_cps_char_index_t charIndex,
                                                    uint8_t attrSize,
                                                    uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult;

    /* Send Notification if it is enabled and connected */
    if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if(charIndex >= CY_BLE_CPS_CHAR_COUNT)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_cpsConfigPtr->cpss->charInfo[charIndex].charHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else if((!CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_cpsConfigPtr->cpss->charInfo[charIndex].charHandle)) ||
            (!CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId, cy_ble_cpsConfigPtr->cpss->charInfo[charIndex].
                                              descrHandle[CY_BLE_CPS_CCCD])))
    {
        apiResult = CY_BLE_ERROR_NTF_DISABLED;
    }
    else
    {
        cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
        {
            /* Fill all fields of write request structure ... */
            .handleValPair.attrHandle = cy_ble_cpsConfigPtr->cpss->charInfo[charIndex].charHandle,
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle
        };
        /* Send notification to the Client using previously filled structure */
        apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
    }

    return(apiResult);
}


