ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
/******************************************************************************
* Function Name: Cy_BLE_CPSS_ConnParamUpdateRspEventHandler
***************************************************************************//**
*
*  Handles the L2CAP connection parameter response event from
*  the BLE stack.
*
*  \param uint16_t response:
*      * Accepted = 0x0000
*      * Rejected = 0x0001
*
******************************************************************************/
static void Cy_BLE_CPSS_ConnParamUpdateRspEventHandler(const cy_stc_ble_l2cap_conn_update_rsp_param_t *eventParam)
{
    if((Cy_BLE_CPS_ApplCallback != NULL) && ((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_PV_PROCEDURE_IN_PROGRESS) != 0u))
    {
        cy_stc_ble_conn_handle_t locConnHandle =
        {
            .bdHandle = eventParam->bdHandle
        };

        cy_ble_cpssFlag &= (uint8_t) ~CY_BLE_CPSS_FLAG_PV_PROCEDURE_IN_PROGRESS;
        if(eventParam->result != 0u)
        {
            /* If the Client does not change the connection parameters Server shall return an ATT Error Response
             * to the Write Request with an Error Code set to the Application Error Code 0x80
             * (Inappropriate Connection Parameters). */
            cy_stc_ble_gatt_err_param_t err_param =
            {
                .errInfo.opCode     = (cy_en_ble_gatt_pdu_t)CY_BLE_GATT_WRITE_REQ,
                .errInfo.attrHandle = cy_ble_cpsConfigPtr->cpss->charInfo[CY_BLE_CPS_POWER_VECTOR].
                                       descrHandle[CY_BLE_CPS_CCCD],
                .errInfo.errorCode  = CY_BLE_GATT_ERR_CPS_INAPPROPRIATE_CONNECTION_PARAMETERS,
                /* get connHandle form cy_ble_connHandle, to have actual value of connHandle.attId */
                .connHandle         = cy_ble_connHandle[Cy_BLE_GetConnHandleIdx(locConnHandle)]
            };
            /* Send Error Response */
            (void)Cy_BLE_GATTS_ErrorRsp(&err_param);
        }
        else
        {
            cy_stc_ble_cps_char_value_t locCharValue =
            {
                .connHandle = cy_ble_connHandle[Cy_BLE_GetConnHandleIdx(locConnHandle)],
                .charIndex  = CY_BLE_CPS_POWER_VECTOR
            };

            cy_stc_ble_gatt_value_t locValue;
            uint8_t cccdVal[2u];
            Cy_BLE_Set16ByPtr(cccdVal, CY_BLE_CCCD_NOTIFICATION);

            /* Otherwise, the Server shall respond with a Write Response and start sending notifications
             * of the Cycling Power Vector characteristic. */
            (void)Cy_BLE_GATTS_WriteRsp(locConnHandle);

            /* get connHandle form cy_ble_connHandle, to have actual value of connHandle.attId */
            locValue.len = CY_BLE_CCCD_LEN;
            locValue.val = cccdVal;
            locCharValue.value = &locValue;

            Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSS_NOTIFICATION_ENABLED, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CPSS_ConnUpdateCompleteEventHandler
***************************************************************************//**
*
*  Handles the CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE event from
*  the BLE stack.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_CPSS_ConnUpdateCompleteEventHandler(const cy_stc_ble_gap_conn_param_updated_in_controller_t *eventParam)
{
    /* Store connection parameters */
    cy_ble_cpssConnParam = *eventParam;
}

#if CY_BLE_GAP_ROLE_BROADCASTER

/******************************************************************************
* Function Name: Cy_BLE_CPSS_StartBroadcast
***************************************************************************//**
*
*  This function is used to start broadcasting of the Cycling Power
*  Measurement characteristic or update broadcasting data when it was started
*  before.
*
*  It is available only in Broadcaster role.
*
*  \param advInterval:     Advertising interval in 625 us units. The valid range is
*                   from CY_BLE_GAP_ADV_ADVERT_INTERVAL_NONCON_MIN
*                   to CY_BLE_GAP_ADV_ADVERT_INTERVAL_MAX. This parameter is ignored
*                   when when broadcasting is already started.
*  \param attrSize:        The size of the characteristic value attribute.
*                   This size is limited by maximum advertising packet length and
*                   advertising header size.
*  \param attrValue:      The pointer to the Cycling Power Measurement characteristic
*                   that include the mandatory fields (e.g. the Flags field and the
*                   Instantaneous Power field) and depending on the Flags field,
*                   some optional fields in a non connectable undirected advertising
*                   event.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                        | Description
*   ------------                       | -----------
*   CY_BLE_SUCCESS                     | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER     | On passing an invalid parameter.
*   CY_BLE_ERROR_INVALID_OPERATION     | Operation is not permitted.
*
******************************************************************************/

cy_en_ble_api_result_t Cy_BLE_CPSS_StartBroadcast(uint16_t advInterval,
                                                  uint8_t attrSize,
                                                  const uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((advInterval < CY_BLE_GAP_ADV_ADVERT_INTERVAL_NONCON_MIN) || (advInterval > CY_BLE_GAP_ADV_ADVERT_INTERVAL_MAX) ||
       (attrSize > (CY_BLE_GAP_MAX_ADV_DATA_LEN - CY_BLE_CPSS_BROADCAST_HEADER_LEN)))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Copy Cycling Power Measurement characteristic value to advertising data packet */
        (void)memcpy(&cy_ble_cpssBroadcastData.advData[CY_BLE_CPSS_BROADCAST_DATA_OFFSET], attrValue, (uint32_t)attrSize);
        cy_ble_cpssBroadcastData.advData[CY_BLE_CPSS_BROADCAST_DATA_LEN_OFFSET] = attrSize;
        cy_ble_cpssBroadcastData.advDataLen = attrSize + CY_BLE_CPSS_BROADCAST_HEADER_LEN;

        if((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_BROADCAST_IN_PROGRESS) == 0u)
        {
            /* Put advertising interval to advertising data packet */
            cy_ble_cpssBroadcastData.advData[CY_BLE_CPSS_BROADCAST_ADVERT_INTERVAL_OFFSET] = CY_LO8(advInterval);
            cy_ble_cpssBroadcastData.advData[CY_BLE_CPSS_BROADCAST_ADVERT_INTERVAL_OFFSET + 1u] = CY_HI8(advInterval);

            /* Configure advertising timeout, interval and type */
            cy_ble_cpssBroadcastParam.advIntvMin = advInterval;
            cy_ble_cpssBroadcastParam.advIntvMax = advInterval;
            cy_ble_cpssBroadcastModeInfo.advTo = 0u;
            cy_ble_cpssBroadcastParam.advType = CY_BLE_GAPP_NON_CONNECTABLE_UNDIRECTED_ADV;
            cy_ble_cpssBroadcastParam.advChannelMap = cy_ble_discoveryParam[cy_ble_advIndex].advChannelMap;

