ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
            /* Start broadcasting */
            apiResult = Cy_BLE_GAPP_EnterDiscoveryMode(&cy_ble_cpssBroadcastModeInfo);
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_cpssFlag |= CY_BLE_CPSS_FLAG_START_BROADCAST;
            }
        }
        else
        {
            /* Update the advertisement packet if the device is in the advertising mode. */
            apiResult = Cy_BLE_GAPP_UpdateAdvScanData(&cy_ble_cpssBroadcastModeInfo);
        }
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CPSS_StopBroadcast
***************************************************************************//**
*
*  This function is used to stop broadcasting of the Cycling Power
*  Measurement characteristic.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INVALID_STATE            | On calling this function not in CPS broadcasting mode.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CPSS_StopBroadcast(void)
{
    cy_en_ble_api_result_t apiResult;

    if((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_BROADCAST_IN_PROGRESS) != 0u)
    {
        apiResult = Cy_BLE_GAPP_ExitDiscoveryMode();
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_cpssFlag |= CY_BLE_CPSS_FLAG_STOP_BROADCAST;
        }
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CPSS_AdvertisementStartStopEventHandler
***************************************************************************//**
*
*  This function handles CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP event for CPS.
*
******************************************************************************/
static void Cy_BLE_CPSS_AdvertisementStartStopEventHandler(void)
{
    if((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_START_BROADCAST) != 0u)
    {
        cy_ble_cpssFlag |= CY_BLE_CPSS_FLAG_BROADCAST_IN_PROGRESS;
        cy_ble_cpssFlag &= (uint8_t) ~CY_BLE_CPSS_FLAG_START_BROADCAST;
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
    if((cy_ble_cpssFlag & CY_BLE_CPSS_FLAG_STOP_BROADCAST) != 0u)
    {
        cy_ble_cpssFlag &= (uint8_t) ~(CY_BLE_CPSS_FLAG_BROADCAST_IN_PROGRESS | CY_BLE_CPSS_FLAG_STOP_BROADCAST);
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

#endif /* CY_BLE_GAP_ROLE_BROADCASTER */

#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_CPSC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP
*  event. Based on the service UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param discCharInfo: The pointer to a characteristic information structure.
*
******************************************************************************/
static void Cy_BLE_CPSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    /* CPS characteristics UUIDs */
    static const cy_ble_uuid16_t cy_ble_cpscCharUuid[CY_BLE_CPS_CHAR_COUNT] =
    {
        CY_BLE_UUID_CHAR_CPS_MSRMT,         /* Cycling Power Measurement characteristic UUID */
        CY_BLE_UUID_CHAR_CPS_FEATURE,       /* Cycling Power Feature characteristic UUID */
        CY_BLE_UUID_CHAR_SENSOR_LOCATION,   /* Cycling Power Sensor Location characteristic UUID */
        CY_BLE_UUID_CHAR_CPS_VECTOR,        /* Cycling Power Vector characteristic UUID */
        CY_BLE_UUID_CHAR_CPS_CP             /* Cycling Power Control Point characteristic UUID */
    };
    static cy_ble_gatt_db_attr_handle_t *lastEndHandle[CY_BLE_CONFIG_GATTC_COUNT] = { NULL };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);
    uint32_t i;

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_CPS))
    {
        /* Update last characteristic endHandle to declaration handle of this characteristic */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = discCharInfo->charDeclHandle - 1u;
            lastEndHandle[discIdx] = NULL;
        }

        for(i = (uint32_t)CY_BLE_CPS_POWER_MEASURE; i < (uint32_t)CY_BLE_CPS_CHAR_COUNT; i++)
        {
            if(cy_ble_cpscCharUuid[i] == discCharInfo->uuid.uuid16)
            {
                Cy_BLE_CheckStoreCharHandle(cy_ble_cpsc[discIdx].charInfo[i]);
                lastEndHandle[discIdx] = &cy_ble_cpsc[discIdx].charInfo[i].endHandle;
                break;
            }
        }

        /* Init characteristic endHandle to the Service endHandle.
         * Characteristic endHandle will be updated to declaration
         * handler of the following characteristic,
         * in the following characteristic discovery procedure. */
        if(lastEndHandle[discIdx] != NULL)
        {
            *lastEndHandle[discIdx] = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.endHandle;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CPSC_DiscoverCharDescriptorsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a "CY_BLE_EVT_GATTC_FIND_INFO_RSP" event.
*  Based on the descriptor UUID, an appropriate data structure is populated using
*  the data received as part of the callback.
*
*  \param discoveryCharIndex:  The characteristic index which is discovered.
*  \param discDescrInfo:      The pointer to a descriptor information structure.
*
******************************************************************************/
static void Cy_BLE_CPSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo)
{
    uint32_t notSupportedDescr = 0u;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discDescrInfo->connHandle);
    uint32_t descIdx;

    if(cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_CPS)
    {
        switch(discDescrInfo->uuid.uuid16)
        {
            case CY_BLE_UUID_CHAR_CLIENT_CONFIG:
                descIdx = (uint32_t)CY_BLE_CPS_CCCD;
                break;

            case CY_BLE_UUID_CHAR_SERVER_CONFIG:
                descIdx = (uint32_t)CY_BLE_CPS_SCCD;
                break;

            default:
                /* Not supported descriptor */
                notSupportedDescr = 1u;
                break;
        }

        if(notSupportedDescr == 0u)
        {
            if(cy_ble_cpsc[discIdx].charInfo[cy_ble_discovery[discIdx].charCount].descrHandle[descIdx] ==
               CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                cy_ble_cpsc[discIdx].charInfo[cy_ble_discovery[discIdx].charCount].descrHandle[descIdx] =
                    discDescrInfo->descrHandle;
            }
            else
            {
                /* Duplication of the descriptor */
                Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DESCR_DUPLICATION, &discDescrInfo);
            }
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


