ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cps.c
/******************************************************************************
* Function Name: Cy_BLE_CPSC_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles Error Response Event.
*
*  \param eventParam:  The pointer to a data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_CPSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    if(eventParam != NULL)
    {
        uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
        if(eventParam->errInfo.attrHandle == cy_ble_cpscReqHandle[discIdx])
        {
            cy_ble_cpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}

/******************************************************************************
* Function Name: Cy_BLE_CPSC_StartObserve
***************************************************************************//**
*
*   This function is used for observing GAP peripheral devices.
*   A device performing the observer role receives only advertisement data from
*   devices irrespective of their discoverable mode settings. Advertisement
*   data received is provided by the event, CY_BLE_EVT_CPSC_SCAN_PROGRESS_RESULT.
*   This procedure sets the scanType sub parameter to passive scanning.
*
*   If 'scanTo' sub-parameter is set to zero value, then passive scanning
*   procedure will continue until you call Cy_BLE_CPSC_StopObserve().
*   Possible generated events are:
*   * CY_BLE_EVT_CPSC_SCAN_PROGRESS_RESULT
*
*  \param scanParamIndex:  The index of the scan configuration.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter for
*                                         |   'scanInfo' or if any element within 'scanInfo' has an invalid value.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CPSC_StartObserve(uint8_t scanParamIndex)
{
    cy_en_ble_api_result_t apiResult;
    cy_stc_ble_gapc_disc_info_t locDiscoveryInfo =
    {
        .discProcedure    = CY_BLE_GAPC_OBSER_PROCEDURE,
        .scanType         = CY_BLE_GAPC_PASSIVE_SCANNING,
        .scanIntv         = cy_ble_configPtr->gapcScanParams[scanParamIndex].fastScanInterval,
        .scanWindow       = cy_ble_configPtr->gapcScanParams[scanParamIndex].fastScanWindow,
        .ownAddrType      = CY_BLE_GAP_ADDR_TYPE_PUBLIC,
        .scanFilterPolicy = CY_BLE_GAPC_ADV_ACCEPT_ALL_PKT,
        .scanTo           = 0u,           /* Disable Timeout */
        .filterDuplicates = CY_BLE_GAPC_FILTER_DUP_DISABLE
    };

    apiResult = Cy_BLE_GAPC_StartDiscovery(&locDiscoveryInfo);

    if(apiResult == CY_BLE_SUCCESS)
    {
        cy_ble_cpscObserverFlag |= CY_BLE_CPSC_FLAG_START_OBSERVE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CPSC_StopObserve
***************************************************************************//**
*
*   This function used to stop the discovery of devices.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INVALID_STATE            | On calling this function not in CPS observing state.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CPSC_StopObserve(void)
{
    cy_en_ble_api_result_t apiResult;

    if((cy_ble_cpscObserverFlag & CY_BLE_CPSC_FLAG_OBSERVE_IN_PROGRESS) != 0u)
    {
        apiResult = Cy_BLE_GAPC_StopDiscovery();
        cy_ble_cpscObserverFlag |= CY_BLE_CPSC_FLAG_STOP_OBSERVE;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_CPSC_ScanStartStopEventHandler
***************************************************************************//**
*
*  This function handles CY_BLE_EVT_GAPC_SCAN_START_STOP event for CPS.
*
******************************************************************************/
static void Cy_BLE_CPSC_ScanStartStopEventHandler(void)
{
    if((cy_ble_cpscObserverFlag & CY_BLE_CPSC_FLAG_START_OBSERVE) != 0u)
    {
        cy_ble_cpscObserverFlag |= CY_BLE_CPSC_FLAG_OBSERVE_IN_PROGRESS;
        cy_ble_cpscObserverFlag &= (uint8_t) ~CY_BLE_CPSC_FLAG_START_OBSERVE;
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
    if((cy_ble_cpscObserverFlag & CY_BLE_CPSC_FLAG_STOP_OBSERVE) != 0u)
    {
        cy_ble_cpscObserverFlag &= (uint8_t) ~(CY_BLE_CPSC_FLAG_OBSERVE_IN_PROGRESS | CY_BLE_CPSC_FLAG_STOP_OBSERVE);
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_CPSC_ScanProcessEventHandler
***************************************************************************//**
*
*  This function handles CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT event for CPS.
*
*  \param eventParam:  the pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_CPSC_ScanProcessEventHandler(cy_stc_ble_gapc_adv_report_param_t *eventParam)
{
    if((cy_ble_cpscObserverFlag & CY_BLE_CPSC_FLAG_OBSERVE_IN_PROGRESS) != 0u)
    {
        if(eventParam->eventType == CY_BLE_GAPC_NON_CONN_UNDIRECTED_ADV)
        {
            if(Cy_BLE_CPS_ApplCallback != NULL)
            {
                cy_stc_ble_cps_char_value_t broadcastValue;
                cy_stc_ble_gatt_value_t locCharValue;
                uint8_t advIndex = 0u;
                do
                {
                    /* Show Cycling Power Measurement characteristic value from Service Data packet. */
                    if((eventParam->data[advIndex] > CY_BLE_CPSC_BROADCAST_DATA_OFFSET) &&
                       (eventParam->data[advIndex + 1u] == (uint8_t)CY_BLE_GAP_ADV_SRVC_DATA_16UUID))
                    {
                        broadcastValue.peerAddrType = eventParam->peerAddrType;
                        broadcastValue.peerBdAddr = eventParam->peerBdAddr;
                        broadcastValue.charIndex = CY_BLE_CPS_POWER_MEASURE;
                        broadcastValue.value = &locCharValue;
                        locCharValue.val = &eventParam->data[advIndex + CY_BLE_CPSC_BROADCAST_DATA_OFFSET];
                        locCharValue.len = (uint16_t)eventParam->data[advIndex] - (CY_BLE_CPSC_BROADCAST_DATA_OFFSET - 1u);
                        Cy_BLE_CPS_ApplCallback((uint32_t)CY_BLE_EVT_CPSC_SCAN_PROGRESS_RESULT, &broadcastValue);
                        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    }
                    advIndex += eventParam->data[advIndex] + 1u;
                }
                while(advIndex < eventParam->dataLen);
            }
        }
        else    /* Filter for all connectable advertising packets */
        {
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}

#endif /* (CY_BLE_CPS_CLIENT) */


